tutorials/multiform/specCellFoam/packingCell/constant/effectiveTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      effectiveTransportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Deff            Deff [ 0 2 -1 0 0 0 0 ] ( 0.019741437 -2.6044239e-08 -2.6275685e-25 2.3921255e-08 0.033338365 -5.2156848e-26 -1.5071478e-23 1.0403177e-22 0.0062035 );

DeffSymm        DeffII [ 0 2 -1 0 0 0 0 ] ( 0.016311504 9.0079105e-09 -2.346497e-23 9.0079105e-09 0.036833909 1.0497473e-22 -2.346497e-23 1.0497473e-22 0.0062035 );

lambda          1.7090136;

CI              CI [ 0 1 0 0 0 0 0 ] ( -0.007076935 -2.7269308e-09 0 );

Ueff            Ueff [ 0 1 -1 0 0 0 0 ] ( 1.1622545 1.2496151e-08 -3.5851564e-23 );


// ************************************************************************* //
