tutorials/multiform/specCellFoam/packingCell/0.init/psiAdj
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      psiAdj;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/DA.H"
dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 2.0;

boundaryField
{
    "solid.*"
    {
        type            $BC;
        RobinD          uniform 1.0;
        RobinK          uniform $Da;
        RobinF          uniform 0;
        value           uniform 0;

    }
    frontAndBack
    {
        type            empty;
    }
    ".*.cyc"
    {
        type            cyclic;
    }

}


// ************************************************************************* //
