tutorials/multiform/specCellFoam/packingCell/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         leastSquares;
}

divSchemes
{
    default                       Gauss linear;
    div(phi,U)          	  bounded Gauss linearUpwindV grad(U);
    div(phi,psi)        	  Gauss vanLeer;
    div(phiAdj,psiAdj)  	  Gauss vanLeer;
    div(phiplus,X)      	  Gauss vanLeer;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

}

laplacianSchemes
{
    default            Gauss linear corrected;
    laplacian(D,psi)   Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}

wallDist
{
    method   meshWave;
}
// ************************************************************************* //
